* Environment

Defines external environment variables and configurations used across modules.
Manually modify the `active-env` block below to switch between prod/dev environments.

Options emacs-prod | emacs-dev
#+NAME: target-env
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "emacs-prod")
#+END_SRC

#+RESULTS: target-env
: "emacs-prod"

Set target os.

Options archlinux | windows
#+NAME: target-os
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "archlinux")  
#+END_SRC

#+RESULTS: target-os
: "archlinux"

Variable definitions for those variables that can shared across all
modules and enviroments. These should be used judiciously.
All other variable definitions should be within their respective code blocks.
#+NAME: emacs-common-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/.config/emacs-common")
#+END_SRC

#+RESULTS: emacs-common-dir
: "~/.config/emacs-common"

Set evnrionment variables.
#+BEGIN_SRC emacs-lisp :noweb yes  :tangle ./modules/env.el
  (setq my/env <<target-env()>>)
  (setq server-name <<target-env()>>) 
#+END_SRC

#+RESULTS:
: emacs-prod

Load my API keys.
#+BEGIN_SRC emacs-lisp :noweb yes  :tangle ./modules/env.el
  (load-file (concat <<emacs-common-dir()>> "/api-keys.el"))
#+END_SRC

#+RESULTS:
: t

Starts emacs in server mode.
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  (require 'server)
  (unless (server-running-p)
     (server-start))
#+END_SRC

Turn off yes/no prompt for evaluating org buffer.
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  ;; Turn of eval protection
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

Emacs Custom File
#+BEGIN_SRC emacs-lisp :tangle ./modules/env.el
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file 'noerror)
#+END_SRC

#+RESULTS:
: t

* Org

Dedicated section for Org due to its scope of potential use and integration with emacs native.

Random notes, commands, quotes, etc. file.
#+NAME: random-notes-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/Documents/Office-Docs (Global Sync)/random_notes.org")
#+END_SRC

#+RESULTS: random-notes-dir
: "~/Documents/Office-Docs (Global Sync)/random_notes.org"

Random notes function for my mini knowledge base. I'll expand on this in the future.
#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/org.el
;; Tell straight not to fetch/build Org; use Emacs' built-in instead.
  (use-package org
    :straight (:type built-in))
  
  (use-package org
         :defer t )
   
   (setq my/random-notes-file <<random-notes-dir()>>)

     ;; Org Capture Template
     (setq org-capture-templates
           '(("r" "Random quick note"
              entry
              (file+headline my/random-notes-file "Inbox")
              "* %U %?\n  :tags: %^{Tags}\n"
              :empty-lines 1)))
     (global-set-key (kbd "C-c r") 'org-capture)
 #+END_SRC

 Enable python code blocks in babel.
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/org.el
 (org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
 #+END_SRC
 
* Email

Dedicated section for email due to its scope of potential use and integration with emacs native.
#+NAME: yahoo-email-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/Maildir/yahoo")
#+END_SRC

#+RESULTS: yahoo-email-dir
: "~/Maildir/yahoo"

#+NAME: yahoo-email-address
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "mkburns61@yahoo.com")    
#+END_SRC

#+RESULTS: yahoo-email-address
: "mkburns61@yahoo.com"

#+NAME: yahoo-email-fullname
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "Mike Burns")    
#+END_SRC

#+RESULTS: yahoo-email-fullname
: "Mike Burns"

Big brother contacts database location.
#+NAME: bbdb-dir
#+BEGIN_SRC emacs-lisp :noweb yes :results value
  (format "\"%s\"" (concat <<emacs-common-dir()>>"/bbdb"))
#+END_SRC

#+RESULTS: bbdb-dir
: "~/.config/emacs-common/bbdb"

Mu4e configuration.
#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/email.el
    (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
    (require 'mu4e)

    (setq mu4e-maildir <<yahoo-email-dir()>>) ;; or wherever your Maildir lives
    (require 'mu4e)

    (setq user-mail-address <<yahoo-email-address()>>)
    (setq user-full-name <<yahoo-email-fullname()>>)

    (setq send-mail-function 'sendmail-send-it
          message-send-mail-function 'sendmail-send-it
          sendmail-program "/usr/bin/msmtp"
          mail-specify-envelope-from t
          mail-envelope-from 'header)

    (defun my/run-mbsync ()
      "Run mbsync to sync mail."
      (start-process-shell-command "mbsync" "*mbsync*" "mbsync -a"))

    ;; Run every 5 minutes (adjust as needed)
    (run-at-time "5 min" 300 #'my/run-mbsync)

    (setq mu4e-update-interval 300)  ;; 5 minutes

    ;; Setup image preview
    (setq mu4e-view-show-images t)
    (setq mu4e-view-use-gnus t) 
    (setq mu4e-view-image-max-width 800)
    (setq mu4e-view-show-addresses 't)

    (setq shr-inhibit-images nil)
    (setq gnus-inhibit-images nil)

    (defun my-mu4e-view-inline-images ()
      "Show images automatically in mu4e."
      (when (fboundp 'shr-put-image)
        (setq mu4e-view-show-images t)))

    (setq url-privacy-level 'low)

    (defun my/mu4e-view-message-no-focus ()
      "View the current message in another window without changing focus."
      (interactive)
      (let ((msg (mu4e-message-at-point)))
        (when msg
          (save-selected-window
            (mu4e-view msg)))))

    (with-eval-after-load 'mu4e
      (define-key mu4e-headers-mode-map (kbd "V") #'my/mu4e-view-message-no-focus))

    ;; Open email in a dedicated frame for better workflow.
    (defun my/mu4e-open-in-dedicated-frame ()
      "Open mu4e in a dedicated frame named 'mu4e'."
      (interactive)
      (let ((bufname "*mu4e*"))
        (if (get-buffer bufname)
            ;; If buffer already exists, raise the frame or switch to it
            (progn
              (select-frame-set-input-focus
               (window-frame (get-buffer-window bufname))))
          ;; Else create new frame and launch mu4e
    	(let* ((frame (make-frame '((name . "mu4e")
                                      (width . 100)
                                      (height . 40)))))
            (select-frame-set-input-focus frame)
            (with-selected-frame frame
              (mu4e)
              (set-window-dedicated-p (selected-window) t))))))

    ;; Use bbdb for email contacts configuration.
    (use-package bbdb
          :defer t )

    (setq bbdb-file <<bbdb-dir()>>)
    (require 'bbdb)
    (require 'bbdb-com)
    (bbdb-initialize 'mu4e 'message)

    (setq mu4e-use-bbdb t)

    (bbdb-mua-auto-update-init 'mu4e)

    (setq message-completion-alist
        '((message-to . bbdb-complete-mail)
          (message-cc . bbdb-complete-mail)
          (message-bcc . bbdb-complete-mail)))

    (define-key message-mode-map (kbd "TAB") 'bbdb-complete-mail)

  ;; --- Mu4e leader menu ---
  (with-eval-after-load 'mu4e
    ;; DWIM wrappers so reply/all/forward work from headers or view
    (defun my/mu4e-reply ()      (interactive) (call-interactively #'mu4e-compose-reply))
    (defun my/mu4e-reply-all ()  (interactive) (call-interactively #'mu4e-compose-wide-reply))
    (defun my/mu4e-forward ()    (interactive) (call-interactively #'mu4e-compose-forward))

    (+general-global-menu! "mail" "e"
      ;; open / sync
      "m" '(mu4e                       :which-key "open mu4e")
      "u" '(mu4e-update-mail-and-index :which-key "update & index")
      ;; compose
      "c" '(mu4e-compose-new           :which-key "new email")
      "r" '(my/mu4e-reply              :which-key "reply")
      "a" '(my/mu4e-reply-all          :which-key "reply all")
      "f" '(my/mu4e-forward            :which-key "forward")
      ;; search
      "s" '(mu4e-headers-search        :which-key "search")
      "S" '(mu4e-headers-search-edit   :which-key "edit last search")))

  ;; Compose-mode keys: send / draft / abort
  (with-eval-after-load 'mu4e-compose
    (general-define-key
     :keymaps 'mu4e-compose-mode-map
     :prefix "M-m"
     "m s" '(message-send-and-exit :which-key "send & exit")
     "m d" '(message-dont-send     :which-key "save draft")
     "m A" '(message-kill-buffer   :which-key "abort")))
#+END_SRC

